//=============================================================================
//
// 3Dシーン管理処理 [scene3d.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _SCENE3D_H_
#define _SCENE3D_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CScene3d :public CScene
{
public:
	CScene3d();
	virtual ~CScene3d();
	virtual HRESULT Init(void);
	virtual void Uninit(void);
	virtual void Update(void);
	virtual void Draw(void);
	void SetPos(D3DXVECTOR3 Pos);
	void SetRot(D3DXVECTOR3 Rot);
	void SetSize(D3DXVECTOR3 Size);
	D3DXVECTOR3 GetPos(void) { return m_Pos; };
	D3DXVECTOR3 GetRot(void) { return m_Rot; };
	D3DXVECTOR3 GetSize(void) { return m_Size; };
private:
	D3DXVECTOR3 m_Pos;			//座標
	D3DXVECTOR3 m_Rot;			//向き
	D3DXVECTOR3 m_Size;			//サイズ
};
#endif